---
kind: method
id: M:Autodesk.Revit.DB.DirectContext3D.DrawContext.GetOverrideColor(Autodesk.Revit.DB.Color@)
source: html/4e25065e-24ec-4378-6c17-79530d93881a.htm
---
# Autodesk.Revit.DB.DirectContext3D.DrawContext.GetOverrideColor Method

Returns override color that will be applied to geometry during rendering.

## Syntax (C#)
```csharp
public static bool GetOverrideColor(
	out Color color
)
```

## Parameters
- **color** (`Autodesk.Revit.DB.Color %`)